code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОбОперацияхСчетамДепо_Новая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВыпискаОбОперацияхСчетамДепо_Новая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документооборот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФаксимилеВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКЭДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Comment>На начало(0), На конец операционного дня(1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОбОперацияхСчетамДепо_Новая/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьКоличествоАктивныхОтборов()
	ЭлементыОтбора		= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	КоличествоАктивных	= 0;
	
	Для Каждого эл Из ЭлементыОтбора Цикл
		Если эл.Использование Тогда
			КоличествоАктивных	= КоличествоАктивных + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоАктивных;
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	// Работа с панелью отборов
	Элементы.ГруппаОтбор.Видимость 	 = Элементы.ФормаОтбор.Пометка;
	
	ОтборПоКлиентам		 = Ложь;
	ОтборПоСчетамДепо	 = Ложь;
	ОтборПоЦеннымБумагам = Ложь;
	ОтборПоЭмитентам	 = Ложь;
	
	ЭлементыОтбора	= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого эл Из ЭлементыОтбора Цикл
		// проверим: существует ли отбор по клиентам, если нет - добавим
		Если СокрЛП(эл.ЛевоеЗначение) = "Клиенты" Тогда
			ОтборПоКлиентам		= Истина;
			Продолжить;
		КонецЕсли;
		// проверим: существует ли отбор по счетам депо, если нет - добавим
		Если СокрЛП(эл.ЛевоеЗначение) = "СчетаДепо" Тогда
			ОтборПоСчетамДепо	= Истина;
			Продолжить;
		КонецЕсли;
		// проверим: существует ли отбор по ценным бумагам, если нет - добавим
		Если СокрЛП(эл.ЛевоеЗначение) = "ЦенныеБумаги" Тогда
			ОтборПоЦеннымБумагам = Истина;
			Продолжить;
		КонецЕсли;
		// проверим: существует ли отбор по эмитентам, если нет - добавим
		Если СокрЛП(эл.ЛевоеЗначение) = "Эмитенты" Тогда
			ОтборПоЭмитентам = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОтборПоКлиентам Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиенты");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	Если НЕ ОтборПоСчетамДепо Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(1, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетаДепо");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	Если НЕ ОтборПоЦеннымБумагам Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(2, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенныеБумаги");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	Если НЕ ОтборПоЭмитентам Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(3, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Эмитенты");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	// получим количество отборов с признаком "Использование"
	КоличествоАктивныхОтборов      	 = ПолучитьКоличествоАктивныхОтборов();
	Элементы.ФормаОтбор.Заголовок  	 = "Отбор" + ?(КоличествоАктивныхОтборов > 0, " (" + КоличествоАктивныхОтборов + ")", "");
	
	// Обработаем элементы МХ
	Если Отчет.МХПоУмолчанию Тогда
		Отчет.МХОтбор					= Константы.МестоХраненияПоУмолчанию.Получить();
		Элементы.МХОтбор.ТолькоПросмотр	= Истина;
	Иначе
		Элементы.МХОтбор.ТолькоПросмотр	= Ложь;
	КонецЕсли;
	// Обработаем элемент выписка
	Элементы.ВыпискаДокумент.ТолькоПросмотр		= Не Отчет.Выписка;
	// Работа с панелью формирования выписок
	Элементы.ГруппаШапкаВыписка.Видимость 	 = Элементы.ФормаНастройкиФормированияВыписок.Пометка;
	Элементы.ФормаНастройкиФормированияВыписок.Картинка	= ?(Отчет.Выписка, БиблиотекаКартинок.СинтаксическийКонтроль,
		БиблиотекаКартинок.ЗадачаОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Отчет.НачПериода, ?(Отчет.КонПериода = Дата("00010101"), Отчет.КонПериода, КонецДня(Отчет.КонПериода)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Отчет.НачПериода = НастройкаПериода.ПолучитьДатуНачала();
			Отчет.КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Отчет.НачПериода;
		Диалог.Период.ДатаОкончания	= ?(Отчет.КонПериода = Дата('0001-01-01'), Отчет.КонПериода, КонецДня(Отчет.КонПериода));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Отчет.НачПериода	= Диалог.Период.ДатаНачала;
			Отчет.КонПериода	= Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборЛевоеЗначение" Тогда
	    Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередУдалением(Элемент, Отказ)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура МХПоУмолчаниюПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаПриИзменении(Элемент = Неопределено)
	Если Не Отчет.Выписка Тогда
		Отчет.ВыпискаДокумент	= ПредопределенноеЗначение("Документ.Выписка.ПустаяСсылка");
	КонецЕсли;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиФормированияВыписок(Команда)
	Элементы.ФормаНастройкиФормированияВыписок.Пометка = НЕ Элементы.ФормаНастройкиФормированияВыписок.Пометка;
	Отчет.Выписка	= Элементы.ФормаНастройкиФормированияВыписок.Пометка;
	ВыпискаПриИзменении();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетСервер()
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СформироватьОтчет(Результат);
	ЗначениеВРеквизитФормы(ЭтотОтчет, "Отчет");
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда = Неопределено) Экспорт
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.НачПериода) Или ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.КонПериода) Тогда 	
		Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = "Не указан период формирования отчета.";
	    Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Отчет.НачПериода > Отчет.КонПериода Тогда
		Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = "Период формирования отчета задан неверно.";
	    Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	 
	
	ВремяНачала = ТекущаяДата();
	СформироватьОтчетСервер();
	Элементы.Результат.ТолькоПросмотр = Ложь;
	ВремяОкончания = ТекущаяДата();
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	
	ПоказатьОповещениеПользователя("Отчет сформирован", , "Время формирования за период "
		+ ПредставлениеПериода(Отчет.НачПериода, КонецДня(Отчет.КонПериода), "ФП=Истина")
		+ " составило " + Окр((ВремяОкончания - ВремяНачала) / 60) + " мин.");
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаДокументПриИзменении(Элемент = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Отчет.ВыпискаДокумент) Тогда
		// ---
		ДанныеОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.ВыпискаДокумент, "ДатаНачПериода,ДатаКонПериода,МХУведомление,ВладелецСчета,СчетДепо,ЦБУведомление,ЭмитентУведомление");
		Отчет.НачПериода	= ДанныеОтчета.ДатаНачПериода;
		Отчет.КонПериода	= ДанныеОтчета.ДатаКонПериода;
		Отчет.МХОтбор		= ДанныеОтчета.МХУведомление;
		Отчет.МХПоУмолчанию	= Ложь;
		// ---
		ЭлементыОтбора	= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		ЭлементыОтбора.Очистить();
		// ---
		НовыйЭлемент = ЭлементыОтбора.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиенты");
		Если ЗначениеЗаполнено(ДанныеОтчета.ВладелецСчета) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение = ДанныеОтчета.ВладелецСчета;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
		// ---
		НовыйЭлемент = ЭлементыОтбора.Вставить(1, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетаДепо");
		Если ЗначениеЗаполнено(ДанныеОтчета.СчетДепо) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение= ДанныеОтчета.СчетДепо;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
	    // ---
		НовыйЭлемент = ЭлементыОтбора.Вставить(2, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенныеБумаги");
		Если ЗначениеЗаполнено(Данныеотчета.ЦБУведомление) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение= ДанныеОтчета.ЦБУведомление;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
		// ---
		НовыйЭлемент = ЭлементыОтбора.Вставить(3, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Эмитенты");
		Если ЗначениеЗаполнено(ДанныеОтчета.ЭмитентУведомление) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение = ДанныеОтчета.ЭмитентУведомление;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
	// ---
	УстановитьВидимостьДоступностьЭлементовФормы();
	// ---
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ВидОтчета.Добавить(Перечисления.ВидыОтчетов.Выписка);
	Отчет.ВидОтчета.Добавить(Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО);
	
	Отчет.НачПериода 	= НачалоМесяца(ТекущаяДатаСеанса());
	Отчет.КонПериода 	= ТекущаяДатаСеанса();
	//
	УстановитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры
